#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StateTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AvalancheTransition_structs.hpp"
#include "AvalancheTransition_classes.hpp"
#include "StateTransitionInfo_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_StateTask.BP_StateTask_C
// 0x0070 (0x00F8 - 0x0088)
class UBP_StateTask_C final : public UAvaTransitionTaskBlueprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FStateTransitionInfo>           States;                                            // 0x0090(0x0010)(Edit, BlueprintVisible)
	TScriptInterface<class IAvaSequencePlaybackObject> Playback_Object;                              // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FStateTransitionInfo                   Current_State;                                     // 0x00B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Delay_Count;                                       // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Snap_State_Sequence;                               // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UWorld>>          Levels_to_Ignore;                                  // 0x00E8(0x0010)(Edit, BlueprintVisible, AdvancedDisplay)

public:
	void Should_Snap_State_Sequence(const struct FStateTreeTransitionResult& Transition, bool* Snap_State_Sequence);
	void ReceiveLatentTick(const float DeltaTime_ReceiveLatentTick);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition_ReceiveLatentEnterState);
	void Process_State(const struct FStateTransitionInfo& Current_State);
	void ExecuteUbergraph_BP_StateTask(int32 EntryPoint);
	void Convert_Scene_List(TArray<struct FSoftWorldReference>& Scenes, TArray<TSoftObjectPtr<class UWorld>>* Scenes_to_Ignore);
	void Conditionally_Finish_Task();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_StateTask_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_StateTask_C")
	}
	static class UBP_StateTask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_StateTask_C>();
	}
};
DUMPER7_ASSERTS_UBP_StateTask_C;

SDK_NAMESPACE_END
