#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StateTask

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "Engine_structs.hpp"
#include "StateTransitionInfo_structs.hpp"
#include "AvalancheTransition_structs.hpp"
#include "AvalancheSequence_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_StateTask.BP_StateTask_C.Should Snap State Sequence
// 0x0060 (0x0060 - 0x0000)
struct BP_StateTask_C_Should_Snap_State_Sequence final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Snap_State_Sequence;                               // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAvaTransitionTree*               CallFunc_GetTransitionTree_ReturnValue;            // 0x0050(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAvaTransitionType                            CallFunc_GetTransitionType_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAvaTransitionInstancingMode                  CallFunc_GetInstancingMode_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StateTask_C_Should_Snap_State_Sequence;

// Function BP_StateTask.BP_StateTask_C.ReceiveLatentTick
// 0x0004 (0x0004 - 0x0000)
struct BP_StateTask_C_ReceiveLatentTick final
{
public:
	float                                         DeltaTime_ReceiveLatentTick;                       // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StateTask_C_ReceiveLatentTick;

// Function BP_StateTask.BP_StateTask_C.ReceiveLatentEnterState
// 0x0048 (0x0048 - 0x0000)
struct BP_StateTask_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition_ReceiveLatentEnterState;                // 0x0000(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_StateTask_C_ReceiveLatentEnterState;

// Function BP_StateTask.BP_StateTask_C.Process State
// 0x0030 (0x0030 - 0x0000)
struct BP_StateTask_C_Process_State final
{
public:
	struct FStateTransitionInfo                   Current_State;                                     // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StateTask_C_Process_State;

// Function BP_StateTask.BP_StateTask_C.ExecuteUbergraph_BP_StateTask
// 0x0330 (0x0330 - 0x0000)
struct BP_StateTask_C_ExecuteUbergraph_BP_StateTask final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAvaSequencePlayParams                 K2Node_MakeStruct_AvaSequencePlayParams;           // 0x0010(0x0070)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreScenesTransitioning_ReturnValue;       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x00A0(0x0048)(ConstParm)
	TScriptInterface<class IAvaSequencePlaybackObject> CallFunc_GetPlaybackObject_ReturnValue;       // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Should_Snap_State_Sequence_Snap_State_Sequence; // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTransitionInfo                   K2Node_CustomEvent_Current_State;                  // 0x0100(0x0030)(HasGetValueTypeHash)
	struct FStateTransitionInfo                   CallFunc_Array_Get_Item;                           // 0x0130(0x0030)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveNameAttribute_ReturnValue;          // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddNameAttribute_ReturnValue;             // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAvaSequencePlayer*>             CallFunc_PlaySequencesByLabel_ReturnValue;         // 0x0170(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsNameAttribute_ReturnValue;        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsNameAttribute_ReturnValue_1;      // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B[0x1];                                      // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x018C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAvaSequencePlayParams                 K2Node_MakeStruct_AvaSequencePlayParams_1;         // 0x0190(0x0070)()
	bool                                          Temp_bool_Variable;                                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAvaSequenceTime                       K2Node_MakeStruct_AvaSequenceTime;                 // 0x0208(0x0030)()
	struct FAvaSequencePlayParams                 CallFunc_MakeSingleFramePlaySettings_ReturnValue;  // 0x0238(0x0070)()
	struct FAvaSequencePlayParams                 K2Node_Select_Default;                             // 0x02A8(0x0070)(ConstParm)
	TArray<class UAvaSequencePlayer*>             CallFunc_PlaySequencesByLabel_ReturnValue_1;       // 0x0318(0x0010)(ReferenceParm)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StateTask_C_ExecuteUbergraph_BP_StateTask;

// Function BP_StateTask.BP_StateTask_C.Convert Scene List
// 0x0078 (0x0078 - 0x0000)
struct BP_StateTask_C_Convert_Scene_List final
{
public:
	TArray<struct FSoftWorldReference>            Scenes;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<TSoftObjectPtr<class UWorld>>          Scenes_to_Ignore;                                  // 0x0010(0x0010)(Parm, OutParm)
	TArray<TSoftObjectPtr<class UWorld>>          Converted_Scenes;                                  // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftWorldReference                    CallFunc_Array_Get_Item;                           // 0x0040(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StateTask_C_Convert_Scene_List;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
