#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SubLayerChangeTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AvalancheTransition_structs.hpp"
#include "AvalancheTransition_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_SubLayerChangeTask.BP_SubLayerChangeTask_C
// 0x00D8 (0x0160 - 0x0088)
class UBP_SubLayerChangeTask_C final : public UAvaTransitionTaskBlueprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EAvaTransitionType                            Transition_Type;                                   // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Update_RC_Values;                                  // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Wait_for_Each;                                     // 0x0092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAvaSequencePlayer*>             ActivePlayers;                                     // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<class URCVirtualPropertyBase*>           Processed_Controllers;                             // 0x00A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class URCVirtualPropertyBase*>         Changed_Controllers;                               // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<class FName>                             Processed_Sequences;                               // 0x0108(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Delay;                                             // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanUpdateInTick;                                   // 0x015C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Remove_Inactive_Players();
	void ReceiveLatentTick(const float DeltaTime_ReceiveLatentTick);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition_ReceiveLatentEnterState);
	void Process_Controller(TScriptInterface<class IAvaSequencePlaybackObject> Playback_Object, class URCVirtualPropertyBase* Controller, bool* Succeed);
	void Process_Changed_Controllers();
	struct FAvaSequenceName Find_Sequence_to_Play_for_Actor(class AActor* Actor, bool* Success);
	void ExecuteUbergraph_BP_SubLayerChangeTask(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SubLayerChangeTask_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SubLayerChangeTask_C")
	}
	static class UBP_SubLayerChangeTask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SubLayerChangeTask_C>();
	}
};
DUMPER7_ASSERTS_UBP_SubLayerChangeTask_C;

SDK_NAMESPACE_END
