#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CDE_MenuCameras

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "E_MenuCameraRig_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function CDE_MenuCameras.CDE_MenuCameras_C.RunCameraDirector
// 0x0020 (0x0020 - 0x0000)
struct CDE_MenuCameras_C_RunCameraDirector final
{
public:
	float                                         DeltaTime_RunCameraDirector;                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                EvaluationContextOwner_RunCameraDirector;          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintCameraDirectorEvaluationParams Params_RunCameraDirector;                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_CDE_MenuCameras_C_RunCameraDirector;

// Function CDE_MenuCameras.CDE_MenuCameras_C.ExecuteUbergraph_CDE_MenuCameras
// 0x0038 (0x0038 - 0x0000)
struct CDE_MenuCameras_C_ExecuteUbergraph_CDE_MenuCameras final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_EvaluationContextOwner;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintCameraDirectorEvaluationParams K2Node_Event_Params;                             // 0x0010(0x0010)(ConstParm, NoDestructor)
	class APlayerController*                      CallFunc_FindEvaluationContextOwnerActor_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuCameraManager_C*                K2Node_DynamicCast_AsBP_Menu_Camera_Manager;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MenuCameraRig                               CallFunc_GetActiveCameraRig_ActiveCameraRig;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CDE_MenuCameras_C_ExecuteUbergraph_CDE_MenuCameras;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
