#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Tyr_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass MainMenu.MainMenu_C
// 0x0080 (0x0330 - 0x02B0)
class AMainMenu_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Spawn_Transform;                                   // 0x02C0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  BannedAsyncAction;                                 // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  SuspendedAsyncAction;                              // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ShowErrorAndLogout();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason_ReceiveEndPlay);
	void ReceiveBeginPlay();
	void OnResult_D34857C845D37E0D0A72BE8DBC3FF223(ETyrMessagingResult Result);
	void OnResult_7373D25F4E8B0FC8574F4D83F4263575(ETyrMessagingResult Result);
	void OnResult_65EDA7D04846156E0E40008F8D27AB91(ETyrMessagingResult Result);
	void OnMessageReceived_E97DE56541B99602322CFDB4CEBB29F2(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_A80A3D62451987E1ADD8758DA446983C(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void ExecuteUbergraph_MainMenu(int32 EntryPoint);
	void BeforePush_7EECB6394A80FF74D4969B84EFCB4468(class UCommonActivatableWidget* UserWidget);
	void AfterPush_7EECB6394A80FF74D4969B84EFCB4468(class UCommonActivatableWidget* UserWidget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MainMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MainMenu_C")
	}
	static class AMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMainMenu_C>();
	}
};
DUMPER7_ASSERTS_AMainMenu_C;

SDK_NAMESPACE_END
